// pages/assistant/index.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    explainsData: [{
        title: '助手是什么鬼东西?',
        content: '1.写雷雨的作文 夏天诠释了种种有关热的真谛，引出了美妙的旋律。那就是雷雨，一首小夜曲，静寂中也不乏激情。 盛夏的中午，格外闷热。太阳公公得意地走了出来，站在写雷雨的作文 夏天诠释了种种有关热的真谛，引出了美妙的旋律。那就是雷雨，一首小夜曲，静寂中也不乏激情。 盛夏的中午，格外闷热。太阳公公得意地走了出来，站在写雷雨的作文 夏天诠释了种种有关热的真谛，引出了美妙的旋律。那就是雷雨，一首小夜曲，静寂中也不乏激情。 盛夏的中午，格外闷热。'
      },
      {
        title: '助手是什么鬼东西?',
        content: '1.写雷雨的作文 夏天诠释了种种有关热的真谛，引出了美妙的旋律。那就是雷雨，一首小夜曲，静寂中也不乏激情。 盛夏的中午，格外闷热。太阳公公得意地走了出来，站在写雷雨的作文 夏天诠释了种种有关热的真谛，引出了美妙的旋律。那就是雷雨，一首小夜曲，静寂中也不乏激情。 盛夏的中午，格外闷热。太阳公公得意地走了出来，站在写雷雨的作文 夏天诠释了种种有关热的真谛，引出了美妙的旋律。那就是雷雨，一首小夜曲，静寂中也不乏激情。 盛夏的中午，格外闷热。'
      },
      {
        title: '助手是什么鬼东西?',
        content: '1.写雷雨的作文 夏天诠释了种种有关热的真谛，引出了美妙的旋律。那就是雷雨，一首小夜曲，静寂中也不乏激情。 盛夏的中午，格外闷热。太阳公公得意地走了出来，站在写雷雨的作文 夏天诠释了种种有关热的真谛，引出了美妙的旋律。那就是雷雨，一首小夜曲，静寂中也不乏激情。 盛夏的中午，格外闷热。太阳公公得意地走了出来，站在写雷雨的作文 夏天诠释了种种有关热的真谛，引出了美妙的旋律。那就是雷雨，一首小夜曲，静寂中也不乏激情。 盛夏的中午，格外闷热。'
      }
    ]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function() {
    wx.setNavigationBarTitle({
      title: '餐匠助手'
    })
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function() {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function() {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function() {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function() {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function() {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function() {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function() {

  }
})